Config/DataProcessors/ФормированиеБухгалтерскихПроводок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеБухгалтерскихПроводок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияИзменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьВалютныеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияПроведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВалютныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУчетПоИФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВалютаВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКурсКратностьВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИФОШапки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокИсправленияОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявительОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыявительОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ПорядокИсправленияОшибокПрошлыхЛет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокИсправленияОшибокПрошлыхЛет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПрошлогоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРанееПрошлогоГода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СостоянияПоддержкиТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияПоддержкиТиповыхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРедактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируетсяССохранениемПоддержки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируетсяБезСохраненияПоддержки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ТиповыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТиповыеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьБлокировку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемаяТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПоддержкиТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеПользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ФормированиеБухгалтерскихПроводок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыАвтоФормированияПроводок() Экспорт

	Возврат Новый Структура("ДопРеквизиты, ТаблицаПроводок, ТекущийОбъект");

КонецФункции

Процедура АвтоФормированиеПроводок(ПараметрыАвтоФормированияПроводок, Отказ = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущийОбъект = ПараметрыАвтоФормированияПроводок.ТекущийОбъект;
	
	ДопРеквизиты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвтоФормированияПроводок,
		"ДопРеквизиты", Новый Структура);
	
	ДатаОрганизация = БухгалтерскиеОперацииСервер.ПолучитьДатуИОрганизациюОперации(ТекущийОбъект, ТиповаяОперация);
	Дата 		= ДатаОрганизация.Дата;
	Организация = ДатаОрганизация.Организация;
	
	ПараметрыЗаполненияПроводок = ПараметрыЗаполненияПроводок();
	ПараметрыЗаполненияПроводок.НаборСвойств 		= ДопРеквизиты;
	ПараметрыЗаполненияПроводок.ДокументОбъект 		= ТекущийОбъект;
	
	РучнаяТранзакция = НЕ ТранзакцияАктивна();
	Если РучнаяТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;
	ПараметрыАвтоФормированияПроводок.ТаблицаПроводок = ЗаполнитьПроводкиДокумента(ПараметрыЗаполненияПроводок, Отказ);
	Если РучнаяТранзакция Тогда
		Если Отказ = Ложь Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыЗаполненияПроводок() Экспорт
	
	ПараметрыЗаполнения = Новый Структура("НаборСвойств, ВнешниеНаборыДанных, ТаблицаОшибок, ПроверятьОшибки,"
		+ "ДокументОбъект, СохраненныеПроводки");
	ПараметрыЗаполнения.ПроверятьОшибки = Ложь;
							
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ЗаполнитьПроводкиДокумента(ПараметрыЗаполненияПроводок, Отказ = Ложь) Экспорт
	
	Перем ОценкаПроизводительностиКлючеваяОперация;
	Перем ВедетсяОценкаПроизводительности;
	Перем ОценкаПроизводительностиВремяНачала;
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат ПустойНаборЗаписей();
	КонецЕсли;

	НаборСвойств        = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаполненияПроводок, "НаборСвойств");
	ТаблицаОшибок       = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаполненияПроводок, "ТаблицаОшибок");
	ПроверятьОшибки     = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаполненияПроводок, "ПроверятьОшибки");
	ДокументОбъект      = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаполненияПроводок, "ДокументОбъект");
	СохраненныеПроводки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаполненияПроводок, "СохраненныеПроводки");


	ПараметрыЗаполненияПроводок.Свойство("НаборСвойств",		НаборСвойств);
	ПараметрыЗаполненияПроводок.Свойство("ТаблицаОшибок",		ТаблицаОшибок);
	ПараметрыЗаполненияПроводок.Свойство("ПроверятьОшибки",		ПроверятьОшибки);
	ПараметрыЗаполненияПроводок.Свойство("ДокументОбъект",		ДокументОбъект);
	ПараметрыЗаполненияПроводок.Свойство("СохраненныеПроводки",	СохраненныеПроводки);
	
	Если НЕ МожноФормировать_ДокументОснованиеПроведен(ДокументОбъект, Отказ) Тогда
		Возврат ПустойНаборЗаписей();
	КонецЕсли;

	ИнициализироватьКонтекстЗаполненияОперации(ДокументОбъект, НаборСвойств);
	
	ДанныеТиповойОперации = Справочники.ТиповыеОперации.ДанныеТиповойОперации(ТиповаяОперация);
	
	НачатьЗамерПроизводительности(ДанныеТиповойОперации,
							      ДокументОбъект, 
								  ОценкаПроизводительностиКлючеваяОперация, 
								  ВедетсяОценкаПроизводительности, 
								  ОценкаПроизводительностиВремяНачала);
	
	ИдентификаторОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация, "ИдентификаторДокумента");;
	ОписаниеИсточников = БухгалтерскиеОперацииСервер.ПолучитьОписаниеСтруктурыОбъекта(ИдентификаторОбъекта);
	ОписаниеИсточников.Вставить("ДополнительныеРеквизиты",
		БухгалтерскиеОперацииСервер.ПолучитьОписаниеСтруктурыТиповойОперации(ТиповаяОперация));
	
	СоответствиеДопИсточников = Неопределено;
	ВнешниеНаборыДанных = БухгалтерскиеОперацииСервер.ПолучитьИсточникиДанныхИзОбъекта(
		ИдентификаторОбъекта,
		ДокументОбъект,
		ТиповаяОперация,
		НаборСвойств,
		ОписаниеИсточников,
		СоответствиеДопИсточников,
		Отказ);
		
	Если Отказ Тогда
		// при формировании источников данных могли быть записаны ошибки в контекст проведения
		ВывестиОшибкиКонтекстаПроведения();
		БухгалтерскиеОперацииСервер.УдалитьКонтекстЗаполненияОперации();
		Возврат ПустойНаборЗаписей();
	КонецЕсли;
	
	// здесь нужно доработать новые источники данных для использования в качестве прежних источников данных
	// и источника данных шапки до тех пор, пока не будут переписаны схемы
	ИзменитьИменаКолонокИсточниковДанных(ОписаниеИсточников, ВнешниеНаборыДанных, СоответствиеДопИсточников);
	
	Если ДокументОбъект<>Неопределено Тогда
		ДокументОбъектДляПолученияШапкиОбъекта = ДокументОбъект;
	Иначе
		ДокументОбъектДляПолученияШапкиОбъекта = ДокументОснование.ПолучитьОбъект();
	КонецЕсли;
	
	Попытка
	
		ИсточникДанныхШапка = БухгалтерскиеОперацииСервер.СоздатьИсточникДанныхИзШапкиОбъекта(
			ДокументОбъектДляПолученияШапкиОбъекта,
			ТиповаяОперация, 
			НаборСвойств);	
	
	Исключение
		
		ПараметрыЗаписиОшибок = ПараметрыЗаписиОшибокФормированияПроводок();
		ПараметрыЗаписиОшибок.МетаданныеДокумента	= ДокументОбъектДляПолученияШапкиОбъекта.Метаданные();
		ПараметрыЗаписиОшибок.Документ 				= ДокументОбъектДляПолученияШапкиОбъекта;
		ПараметрыЗаписиОшибок.ТекстОшибки 			= "Ошибка формирования источника данных из шапки";
		ПараметрыЗаписиОшибок.ОписаниеОшибки		= ИнформацияОбОшибке();
		
		ЗаписатьОшибкуФормированияПроводок(
			ПараметрыЗаписиОшибок,
			БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииФормированиеПроводокПроведение(),
			Отказ);
		БухгалтерскиеОперацииСервер.УдалитьКонтекстЗаполненияОперации();
		Возврат ПустойНаборЗаписей();
	
	КонецПопытки;
	
	РезультатыПроверкиУсловия = Неопределено;
	Попытка
	
		БухгалтерскиеОперацииСервер.РассчитатьРеквизитыОперации(ТиповаяОперация, 
																ИсточникДанныхШапка,
																РезультатыПроверкиУсловия);
	
	Исключение
		
		// запись в журнал регистрации была произведена из самой процедуры РассчитатьРеквизитыОперации
		Если Не ЗначениеЗаполнено(РезультатыПроверкиУсловия.ТекстСообщенияПриОшибке) Тогда
			ТекстСообщенияПриОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Иначе
			ТекстСообщенияПриОшибке = РезультатыПроверкиУсловия.ТекстСообщенияПриОшибке;
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПриОшибке,,,,Отказ);
		Возврат ПустойНаборЗаписей();
		
	КонецПопытки;
	
	Если РезультатыПроверкиУсловия.УсловиеФормирования = ЛОЖЬ Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатыПроверкиУсловия.ТекстСообщенияПриОшибке,,,,Отказ);
		Возврат ПустойНаборЗаписей();
	КонецЕсли;
	
	Если ДанныеТиповойОперации.ИспользуетсяВнешняяПроцедура Тогда
		
		ТаблицаПроводок = СформироватьПроводкиПоВнешнейФункции(ДокументОбъект, НаборСвойств, Отказ);
		
	Иначе
		
		ПараметрыФормирования = Новый Структура;
		ПараметрыФормирования.Вставить("ВнешниеНаборыДанных",	ВнешниеНаборыДанных);
		ПараметрыФормирования.Вставить("НаборСвойств",			НаборСвойств);
		ПараметрыФормирования.Вставить("ДанныеТиповойОперации",	ДанныеТиповойОперации);
		ПараметрыФормирования.Вставить("КонтекстПроведения",	БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации());
		ПараметрыФормирования.Вставить("ДокументОбъект",		ДокументОбъект);
		
		ТаблицаПроводок = СформироватьПроводкиПоСхеме(ПараметрыФормирования, ОписаниеИсточников, Отказ);
		
	КонецЕсли;
	
	ВывестиОшибкиКонтекстаПроведения(Отказ);
	
	Если Отказ Тогда
		Возврат ТаблицаПроводок;
	КонецЕсли;

	ВыполнитьОбработчикПослеФормирования(ДанныеТиповойОперации, ТаблицаПроводок, ДокументОбъект, НаборСвойств, Отказ);
	ПроверитьЗначенияВидовСубконто(ТаблицаПроводок);
	
	Если Отказ Тогда
		Возврат ТаблицаПроводок;
	КонецЕсли;
	
	Если ТаблицаПроводок.Количество() > 0
		И ЗначениеЗаполнено(ИсправлениеОшибки) 
		И ИсправлениеОшибки <> Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка Тогда
		
		ПараметрыИсправленияОшибок = БухгалтерскийУчет.ПараметрыИсправленияОшибокПрошлыхЛет();
		ПараметрыИсправленияОшибок.ПорядокИсправленияОшибок = ИсправлениеОшибки;
		ПараметрыИсправленияОшибок.ВыявительОшибки          = ВыявительОшибки;
		ПараметрыИсправленияОшибок.ПричинаОшибки            = ПричинаОшибки;
		БухгалтерскийУчет.ОтразитьИсправлениеОшибокПрошлыхЛетВТаблицеПроводок(ТаблицаПроводок, ПараметрыИсправленияОшибок, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат ТаблицаПроводок;
	КонецЕсли;
	
	Если ВедетсяОценкаПроизводительности Тогда
		ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительностиКлючеваяОперация, ОценкаПроизводительностиВремяНачала);
	КонецЕсли;
	
	БухгалтерскиеОперацииСервер.УдалитьКонтекстЗаполненияОперации();
	Возврат ТаблицаПроводок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗначенияВидовСубконто(ТаблицаПроводок)

	ВидыСубконтоПустаяСсылка = ПланыВидовХарактеристик.ВидыСубконто.ПустаяСсылка();;
	Для каждого Проводка Из ТаблицаПроводок Цикл
	
		Для НомерСубконто = 1 По 3 Цикл
		
			Если Проводка["ВидСубконтоДт" + НомерСубконто] = Неопределено Тогда
				Проводка["ВидСубконтоДт" + НомерСубконто] = ВидыСубконтоПустаяСсылка;
			КонецЕсли;
			Если Проводка["ВидСубконтоКт" + НомерСубконто] = Неопределено Тогда
				Проводка["ВидСубконтоКт" + НомерСубконто] = ВидыСубконтоПустаяСсылка;
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

Процедура ИнициализироватьКонтекстЗаполненияОперации(ДокументОбъект, НаборСвойств)
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации(Истина);
	КонтекстПроведения.ТиповаяОперация 	= ТиповаяОперация;
	КонтекстПроведения.Ссылка			= ДокументОснование;
	КонтекстПроведения.ДокументОбъект	= ДокументОбъект;
	КонтекстПроведения.ДокументОбъектСериализованный = ОбщегоНазначения.ЗначениеВСтрокуXML(ДокументОбъект);
	Если НаборСвойств.Свойство("Курс") Тогда
		КонтекстПроведения.Курс 		= НаборСвойств.Курс;
		КонтекстПроведения.Кратность	= НаборСвойств.Кратность;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Курс", ДокументОбъект.Метаданные()) Тогда
		КонтекстПроведения.Курс 		= ДокументОбъект.Курс;
		КонтекстПроведения.Кратность	= ДокументОбъект.Кратность;
	КонецЕсли;
	КонтекстПроведения.ПроверятьЗаполнениеРеквизитов =
		БухгалтерскиеОперацииКлиентСервер.ПроверятьЗаполнениеДополнительныхРеквизитов(ДокументОбъект);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
КонецПроцедуры

// Выполняет процедуру, указанную в качестве обработчика ПослеФормированияПроводок типовой операции
//
Процедура ВыполнитьОбработчикПослеФормирования(ДанныеТиповойОперации, ТаблицаПроводок, ДокументОбъект, НаборСвойств, Отказ)

	Если ЗначениеЗаполнено(ДанныеТиповойОперации.ОбработчикПослеФормирования) Тогда
		
		ИменаОбработчиков = СтрРазделить(ДанныеТиповойОперации.ОбработчикПослеФормирования, ";", Ложь);
		
		Для каждого ТекОбработчик Из ИменаОбработчиков Цикл
			
			ИзПереопределяемогоМодуля = Ложь;
			СоставИмениОбработчика = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ТекОбработчик);
			Если СоставИмениОбработчика.Количество() = 1 Тогда
				ИмяМодуля = "БухгалтерскиеОперацииОбработчики";
				ИмяПроцедуры = СоставИмениОбработчика[0];
			Иначе
				ИмяПроцедуры = СоставИмениОбработчика[1];
				ИменаМодулейОбработчиков = БухгалтерскиеОперацииСервер.ОписанияМодулейРасширений("Обработчики");
				Если ИменаМодулейОбработчиков.Свойство(СоставИмениОбработчика[0]) Тогда
					ИмяМодуля = СоставИмениОбработчика[0];
				Иначе
					ИмяМодуля = "БухгалтерскиеОперацииОбработчикиПереопределяемый";
					ИзПереопределяемогоМодуля = Истина;
				КонецЕсли;
			КонецЕсли;
			Попытка
				Модуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
				Если ИзПереопределяемогоМодуля Тогда
					Модуль.ВыполнитьПроцедуруОбработчика(ИмяПроцедуры, ТаблицаПроводок, ДокументОбъект, НаборСвойств);
				Иначе
					Модуль.ВыполнитьОбработчик(ИмяПроцедуры, ТаблицаПроводок, ДокументОбъект, НаборСвойств);
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации(
					БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииФормированиеПроводокСобытиеПослеФормирования(),
					УровеньЖурналаРегистрации.Ошибка,
					,
					ДокументОбъект,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение;
			КонецПопытки;
		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ИзменитьИменаКолонокИсточниковДанных(ОписаниеИсточников, ВнешниеНаборыДанных, СоответствиеДопИсточников)

	Для каждого ТекущийИсточникДанных Из ВнешниеНаборыДанных Цикл
			
		Если ТекущийИсточникДанных.Ключ = "ДокументОбъект" Тогда
			Продолжить; // не нужно обрабатывать
		КонецЕсли;
		
		Если ТекущийИсточникДанных.Ключ <> "Документ" Тогда
			
			РеквизитыТЧ = Неопределено;
			Если НЕ ОписаниеИсточников.ТабличныеЧасти.Свойство(ТекущийИсточникДанных.Ключ) Тогда
				Если СоответствиеДопИсточников = Неопределено Тогда
					Продолжить;
				ИначеЕсли СоответствиеДопИсточников[ТекущийИсточникДанных.Ключ] = Неопределено Тогда
					
				ИначеЕсли ОписаниеИсточников.ТабличныеЧасти.Свойство(СоответствиеДопИсточников[ТекущийИсточникДанных.Ключ]) Тогда
					РеквизитыТЧ = ОписаниеИсточников.ТабличныеЧасти[СоответствиеДопИсточников[ТекущийИсточникДанных.Ключ]].Реквизиты;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				РеквизитыТЧ = ОписаниеИсточников.ТабличныеЧасти[ТекущийИсточникДанных.Ключ].Реквизиты;	
			КонецЕсли;
			
			Если РеквизитыТЧ <> Неопределено Тогда
				ПрефиксТЧ = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных(ТекущийИсточникДанных.Ключ);
			
				Для каждого РеквизитИсточника Из РеквизитыТЧ Цикл
				
					ИмяКолонки = ПрефиксТЧ + РеквизитИсточника.Имя;
					
					Колонка = ТекущийИсточникДанных.Значение.Колонки.Найти(ИмяКолонки);
					Если Колонка = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НовоеИмяКолонки = РеквизитИсточника.Имя;
					Если ТекущийИсточникДанных.Значение.Колонки.Найти(НовоеИмяКолонки) <> Неопределено Тогда
						// такая колонка уже есть. При попытке изменения имени возникнет исключение
						Продолжить;
					КонецЕсли;
					Колонка.Имя = НовоеИмяКолонки;
				
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли; 
		
		ПрефиксДокумент = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
		Для каждого РеквизитИсточника Из ОписаниеИсточников.Реквизиты Цикл
		
			ИмяКолонки = ПрефиксДокумент + РеквизитИсточника.Имя;
			
			Колонка = ТекущийИсточникДанных.Значение.Колонки.Найти(ИмяКолонки);
			Если Колонка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если РеквизитИсточника.Имя = "Ссылка" Тогда
				НовоеИмяКолонки = "Ссылка";
			Иначе
				НовоеИмяКолонки = "РеквизитШапки" + РеквизитИсточника.Имя;
			КонецЕсли;
			Если ТекущийИсточникДанных.Значение.Колонки.Найти(НовоеИмяКолонки) <> Неопределено Тогда
				// такая колонка уже есть. При попытке изменения имени возникнет исключение
				Продолжить;
			КонецЕсли;
			Колонка.Имя = НовоеИмяКолонки;
		
		КонецЦикла;
	
	КонецЦикла;
КонецПроцедуры

Функция МожноФормировать_ДокументОснованиеПроведен(ДокументОбъект, Отказ)

	Если ДокументОбъект = Неопределено И НЕ ДокументОснование.Проведен Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Операция не проводится. Не проведен документ основание.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ПустойНаборЗаписей()
	Возврат РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей().Выгрузить();	
КонецФункции

Процедура НачатьЗамерПроизводительности(ДанныеТиповойОперации,
										ДокументОбъект, 
										ОценкаПроизводительностиКлючеваяОперация, 
										ВедетсяОценкаПроизводительности, 
										ОценкаПроизводительностиВремяНачала)

	ВедетсяОценкаПроизводительности = Ложь;
	Если ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности()
		И ЗначениеЗаполнено(ДанныеТиповойОперации.Условие) Тогда
		
		Если ДокументОбъект = Неопределено Тогда
			Документ = ДокументОснование.ПолучитьОбъект();
		Иначе
			Документ = ДокументОбъект;
		КонецЕсли;
		
		Если Документ.ДополнительныеСвойства.Свойство("ВедетсяОценкаПроизводительности") Тогда
			ВедетсяОценкаПроизводительности = Истина;
			Документ.ДополнительныеСвойства.Свойство("ОценкаПроизводительностиКлючеваяОперация", ОценкаПроизводительностиКлючеваяОперация);
			Документ.ДополнительныеСвойства.Свойство("ОценкаПроизводительностиВремяНачала", ОценкаПроизводительностиВремяНачала);
		ИначеЕсли БухгалтерскиеОперацииСервер.ПоТиповойОперацииВедетсяОценкаПроизводительности(
			ТиповаяОперация,
			ДанныеТиповойОперации.Условие, 
			ОценкаПроизводительностиКлючеваяОперация) Тогда
				
			ВедетсяОценкаПроизводительности = Истина;	
			ОценкаПроизводительностиВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ПараметрыЗаписиОшибокФормированияПроводок()

	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		МетаданныеДокумента = ДокументОснование.Метаданные();
	ИначеЕсли ЗначениеЗаполнено(ТиповаяОперация) Тогда
		ИдентификаторДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация, "ИдентификаторДокумента");
		Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
		Иначе
			МетаданныеДокумента = Неопределено;
		КонецЕсли;
	Иначе
		МетаданныеДокумента = Неопределено;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("МетаданныеДокумента, Документ, ТиповаяОперация, ТекстОшибки, ОписаниеОшибки");
	ПараметрыЗаписи.МетаданныеДокумента = МетаданныеДокумента;
	ПараметрыЗаписи.Документ            = ДокументОснование;
	ПараметрыЗаписи.ТиповаяОперация     = ТиповаяОперация;
	ПараметрыЗаписи.ТекстОшибки         = "";
	ПараметрыЗаписи.ОписаниеОшибки      = "";
	
	Возврат ПараметрыЗаписи;

КонецФункции

Процедура ЗаписатьОшибкуФормированияПроводок(ПараметрыЗаписиОшибок, Событие, Отказ)
	
	Если ПараметрыЗаписиОшибок.ОписаниеОшибки <> Неопределено Тогда
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ПараметрыЗаписиОшибок.ОписаниеОшибки);
		ТекстСообщения = НСтр("ru = 'При формировании проводок произошли ошибки: %1. Подробности в журнале регистрации'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОписаниеОшибки);
	Иначе
		ТекстСообщения = НСтр("ru = 'При формировании проводок произошли ошибки. Подробности в журнале регистрации'");
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	
	РеквизитыТиповойОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЗаписиОшибок.ТиповаяОперация,
		"Наименование, СостояниеПоддержки, ПоставляемаяТиповаяОперация");
		
	Если ЗначениеЗаполнено(РеквизитыТиповойОперации.СостояниеПоддержки)
		И ЗначениеЗаполнено(РеквизитыТиповойОперации.ПоставляемаяТиповаяОперация) Тогда
		
		ИдОперации = РеквизитыТиповойОперации.ПоставляемаяТиповаяОперация.УникальныйИдентификатор();
		
		Если РеквизитыТиповойОперации.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.НеРедактируется Тогда
			
			ШаблонТекстаПоддерржки = НСтр("ru = 'на поддержке (%1)'");
			
		ИначеЕсли РеквизитыТиповойОперации.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяССохранениемПоддержки Тогда
			
			ШаблонТекстаПоддерржки = НСтр("ru = 'редактируется с сохранением поддержки (%1)'");
			
		Иначе
			
			ШаблонТекстаПоддерржки = НСтр("ru = 'снята с поддержки (%1)'");
			
		КонецЕсли;
		
		ТекстПоддержки = СтрШаблон(ШаблонТекстаПоддерржки, Строка(ИдОперации));
		
	Иначе
		
		ТекстПоддержки = НСтр("ru = 'создана пользователем'");
		
	КонецЕсли;
	
	ТекстЗаписиОбОшибке = НСтр("ru = 'Вид документа = [ВидДокумента]
									|Документ = [Документ]
									|Типовая операция = [ТиповаяОперация]
									|Состояние поддержки = [НаПоддержке]
									|[ТекстОшибки]
									|Описание ошибки:
									|[ОписаниеОшибки]'");
	ПараметрыЗаписиОбОшибке = Новый Структура("ВидДокумента, Документ, ТиповаяОперация, НаПоддержке, ТекстОшибки, ОписаниеОшибки");
	ПараметрыЗаписиОбОшибке.ВидДокумента    = ПараметрыЗаписиОшибок.МетаданныеДокумента.Синоним;
	ПараметрыЗаписиОбОшибке.Документ        = ПараметрыЗаписиОшибок.Документ;
	ПараметрыЗаписиОбОшибке.ТиповаяОперация = РеквизитыТиповойОперации.Наименование;
	ПараметрыЗаписиОбОшибке.НаПоддержке     = ТекстПоддержки;
	ПараметрыЗаписиОбОшибке.ТекстОшибки     = ПараметрыЗаписиОшибок.ТекстОшибки;
	ПараметрыЗаписиОбОшибке.ОписаниеОшибки  = ПодробноеПредставлениеОшибки(ПараметрыЗаписиОшибок.ОписаниеОшибки);
	
	ЗаписьЖурналаРегистрации(Событие,
							 УровеньЖурналаРегистрации.Ошибка,
							 ПараметрыЗаписиОшибок.МетаданныеДокумента,
							 ПараметрыЗаписиОшибок.Документ,
							 СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстЗаписиОбОшибке, ПараметрыЗаписиОбОшибке),
							 РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);

КонецПроцедуры

Функция СформироватьПроводкиПоВнешнейФункции(ДокументОбъект, НаборСвойств, Отказ)

	ОбъектПроведения = ?(ДокументОбъект = Неопределено, ДокументОснование.ПолучитьОбъект(), ДокументОбъект);
	
	Попытка
		ТаблицаПроводок = БухгалтерскиеОперацииПроведениеДокументов.ПроведениеПоВнешнейФункции(ОбъектПроведения,
																							   ТиповаяОперация,
																							   НаборСвойств,
																							   Отказ);
		
	Исключение
		
		ПараметрыЗаписиОшибок = ПараметрыЗаписиОшибокФормированияПроводок();
		ПараметрыЗаписиОшибок.МетаданныеДокумента	= ОбъектПроведения.Метаданные();
		ПараметрыЗаписиОшибок.Документ 				= ОбъектПроведения.Ссылка;
		ПараметрыЗаписиОшибок.ТекстОшибки 			= НСтр("ru = 'Ошибка проведения по внешней функции'");
		ПараметрыЗаписиОшибок.ОписаниеОшибки		= ИнформацияОбОшибке();
		
		ЗаписатьОшибкуФормированияПроводок(
			ПараметрыЗаписиОшибок,
			БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииПроведениеПоВнешнейФункции(),
			Отказ);
		
		ТаблицаПроводок = ПустойНаборЗаписей();
		
	КонецПопытки;
	
	Возврат ТаблицаПроводок;

КонецФункции

Функция СформироватьПроводкиПоСхеме(ПараметрыФормирования, ОписаниеИсточников, Отказ)

	ВнешниеНаборыДанных		= ПараметрыФормирования.ВнешниеНаборыДанных;
	НаборСвойств			= ПараметрыФормирования.НаборСвойств;
	ДанныеТиповойОперации	= ПараметрыФормирования.ДанныеТиповойОперации;
	КонтекстПроведения		= ПараметрыФормирования.КонтекстПроведения;
	ДокументОбъект			= ПараметрыФормирования.ДокументОбъект; // ДокументОбъект
	
	Попытка
		
		Если НЕ ВДокументеЕстьДанныеДляФормированияПроводок(ВнешниеНаборыДанных) Тогда
			Возврат ПустойНаборЗаписей();
		КонецЕсли;
		
	Исключение
		
		ПараметрыЗаписиОшибок = ПараметрыЗаписиОшибокФормированияПроводок();
		ПараметрыЗаписиОшибок.МетаданныеДокумента	= ДокументОснование.Метаданные();
		ПараметрыЗаписиОшибок.Документ 				= ДокументОснование.ПолучитьОбъект();
		Если ВнешниеНаборыДанных = Неопределено Тогда
			ПараметрыЗаписиОшибок.ТекстОшибки 		= НСтр("ru = 'Ошибка формирования источника данных из объекта'");
		Иначе
			ПараметрыЗаписиОшибок.ТекстОшибки 		= НСтр("ru = 'Ошибка заполнения внешних источников данных'");
		КонецЕсли;
		ПараметрыЗаписиОшибок.ОписаниеОшибки		= ИнформацияОбОшибке();
		
		ЗаписатьОшибкуФормированияПроводок(
			ПараметрыЗаписиОшибок,
			БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииФормированиеПроводокПроведение(),
			Отказ);
		Возврат ПустойНаборЗаписей();
	
	КонецПопытки;
	
	СхемаКомпоновки = ДанныеТиповойОперации.СхемаФормированияПроводок.Получить(); // СхемаКомпоновкиДанных
	Если ТипЗнч(СхемаКомпоновки) <> Тип("СхемаКомпоновкиДанных") Тогда
		ТекстСообщения = НСтр("ru = 'Не задана схема компоновки у типовой операции. Откройте типовую операцию и нажмите кнопку ""Сохранить и закрыть"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ТиповаяОперация);
		Возврат Неопределено;
	КонецЕсли;
	
	// Изменить длину поля "Сумма"
	// В ранее сохраненных схемах формирования длина поля 15.2, вместо указанного в формуле 18.2
	ВычисляемоеПоле = СхемаКомпоновки.ВычисляемыеПоля.Найти("Сумма");
	Если ВычисляемоеПоле <> Неопределено И ВычисляемоеПоле.ТипЗначения.КвалификаторыЧисла.Разрядность < 18 Тогда
		ВычисляемоеПоле.ТипЗначения = Новый ОписаниеТипов(ВычисляемоеПоле.ТипЗначения, , , Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	КонецЕсли;
	
	// Если поля дополнительных реквизитов источников данных заданы без префикса, то необходимо модифицировать
	// все источники данных, чтобы данные дополнительных реквизитов типовых операций были в колонках без префикса.
	// При этом возможно проявление ошибки 00-00126466. Это не страшно, т.к. после сохранения типовой операции
	// колонки поле дополнительных реквизитов задаются с префиксом.
	ПереименоватьКолонкиДополнительныхРеквизитов(ОписаниеИсточников, ВнешниеНаборыДанных, СхемаКомпоновки);
	
	// Поля первичного документа зависят от настройки типовой операции и метаданных документа.
	// Чтобы не переписывать все типовые операции при обновлении, тексты запроса и тексты полей меняются динамически.
	ЗаменитьТекстыЗапросаВыборкиПроводок(СхемаКомпоновки);
	
	НастройкиСхемы = Неопределено;
	ПараметрыИнициализации = Новый Структура(	"ТиповаяОперация, ДокументОснование, Дата, Организация, НаборСвойств");
	ПараметрыИнициализации.ТиповаяОперация   = ТиповаяОперация;
	ПараметрыИнициализации.ДокументОснование = ДокументОснование;
	ПараметрыИнициализации.Дата              = Дата;
	ПараметрыИнициализации.Организация       = Организация;
	ПараметрыИнициализации.НаборСвойств      = НаборСвойств;
	
	БухгалтерскиеОперацииСервер.ИнициализироватьСхемуФормированияПроводок(СхемаКомпоновки,
																		  НастройкиСхемы,
																		  ПараметрыИнициализации);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
	
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
													  НастройкиСхемы.Настройки,
													  ,
													  ,
													  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,,Истина); 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ТаблицаПроводок=ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   
		
	Исключение
		
		Если КонтекстПроведения.ИсключениеПриПроверкеЗаполнения Тогда
			
			Отказ = Истина;
			
		Иначе
			ПараметрыЗаписиОшибок = ПараметрыЗаписиОшибокФормированияПроводок();
			Если ДокументОбъект = Неопределено Тогда
				ПараметрыЗаписиОшибок.МетаданныеДокумента = ДокументОснование.Метаданные();
				ПараметрыЗаписиОшибок.Документ            = ДокументОснование;
			Иначе
				ПараметрыЗаписиОшибок.МетаданныеДокумента = ДокументОбъект.Метаданные();
				ПараметрыЗаписиОшибок.Документ            = ДокументОснование;
			КонецЕсли;
			ПараметрыЗаписиОшибок.ТекстОшибки    = НСтр("ru = 'Ошибка формирования проводок'");
			ПараметрыЗаписиОшибок.ОписаниеОшибки = ИнформацияОбОшибке();
			
			ЗаписатьОшибкуФормированияПроводок(
				ПараметрыЗаписиОшибок,
				БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииФормированиеПроводокПроведение(),
				Отказ);
		
			Возврат ТаблицаПроводок;
			
		КонецЕсли;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТаблицаПроводок = Неопределено Тогда
		Возврат ТаблицаПроводок;
	КонецЕсли;
	
	СортироватьТаблицуПроводок(ТаблицаПроводок);
	ПроверитьЗаполнениеВидовСубконтоПодразделений(ТаблицаПроводок);
	СократитьСтроковыеПоляТаблицыПроводок(ТаблицаПроводок);
	
	Возврат ТаблицаПроводок;

КонецФункции

Процедура ЗаменитьТекстыЗапросаВыборкиПроводок(СхемаКомпоновки)
	
	НаборНастройкаПроводок = СхемаКомпоновки.НаборыДанных.НастройкаПроводок;
	ИспользуетсяПоставляемаяСхема = СтрНайти(НаборНастройкаПроводок.Запрос, "ПоставляемыеПроводкиТиповыхОпераций") > 0;
	
	Если ИспользуетсяПоставляемаяСхема Тогда
		ТекстЗапроса = Справочники.ПоставляемыеТиповыеОперации.ТекстЗапросаНастройкиПроводок();
	Иначе
		ОбразецСКД = Справочники.ТиповыеОперации.ПолучитьМакет("ОбразецСКД");
		ТекстЗапроса = ОбразецСКД.НаборыДанных.НастройкаПроводок.Запрос;
	КонецЕсли;
	НаборНастройкаПроводок.Запрос = ТекстЗапроса;
	
	Поле = НаборНастройкаПроводок.Поля.Найти("НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента");
	Если Поле <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Поле = НаборНастройкаПроводок.Поля.Найти("ИспользоватьФормулуПервичногоДокумента");
	Если Поле = Неопределено Тогда
		Поле = НаборНастройкаПроводок.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных")); // ПолеКомпоновкиДанных
		Поле.Поле = "ИспользоватьФормулуПервичногоДокумента";
	КонецЕсли;
	Поле.ПутьКДанным = "НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента";
	
КонецПроцедуры

Процедура СортироватьТаблицуПроводок(ТаблицаПроводок)
	Если ТаблицаПроводок.Колонки.Найти("НастройкаПроводокПорядковыйНомерГруппы") <> Неопределено Тогда
		ТаблицаПроводок.Сортировать("НастройкаПроводокПорядковыйНомерГруппы,НомерСтроки,НастройкаПроводокПорядковыйНомерВГруппе");
	ИначеЕсли ТаблицаПроводок.Колонки.Найти("СистемныеПоляНомерПоПорядку") <> Неопределено Тогда
		ТаблицаПроводок.Сортировать("СистемныеПоляНомерПоПорядку");
	КонецЕсли;
КонецПроцедуры

Функция ВДокументеЕстьДанныеДляФормированияПроводок(ВнешниеНаборыДанных)
	
	ИспользуемыеТЧ = БухгалтерскиеОперацииСервер.ПолучитьИспользуемыеВПроводкахТЧ(ТиповаяОперация);
	Для каждого ТекИспользуемаяТЧ Из ИспользуемыеТЧ Цикл
		
		Если ТекИспользуемаяТЧ = "Документ" Тогда
			Возврат Истина;
			
		ИначеЕсли ВнешниеНаборыДанных.Свойство(ТекИспользуемаяТЧ)
			И ТипЗнч(ВнешниеНаборыДанных[ТекИспользуемаяТЧ]) = Тип("ТаблицаЗначений")
			И ВнешниеНаборыДанных[ТекИспользуемаяТЧ].Количество() > 0 Тогда
					
			Возврат Истина;
		КонецЕсли;
	
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

Процедура ПереименоватьКолонкиДополнительныхРеквизитов(ОписаниеИсточников, ВнешниеНаборыДанных, СхемаКомпоновки)

	Если ОписаниеИсточников.ДополнительныеРеквизиты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ПрефиксДопРеквизит = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит");
	ТребуетсяОбработка = Ложь;
	
	Для каждого НаборДанныхСхемы Из СхемаКомпоновки.НаборыДанных.ДанныеДокумента.Элементы Цикл
	
		ПолеДопРеквизита = НаборДанныхСхемы.Поля.Найти(
			"ДополнительныеРеквизиты." + ОписаниеИсточников.ДополнительныеРеквизиты[0].Имя);
		Если ПолеДопРеквизита = Неопределено Тогда
			// поле доп. реквизита не найдено
			Прервать;
		КонецЕсли;
		
		ТребуетсяОбработка = НЕ СтрНачинаетсяС(ПолеДопРеквизита.Поле, ПрефиксДопРеквизит);
		Прервать;
	
	КонецЦикла;
	
	Если НЕ ТребуетсяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущийИсточникДанных Из ВнешниеНаборыДанных Цикл
		
		Если ТекущийИсточникДанных.Ключ = "ДокументОбъект" Тогда
			Продолжить; // не нужно обрабатывать
		КонецЕсли;
		
		Для каждого РеквизитИсточника Из ОписаниеИсточников.ДополнительныеРеквизиты Цикл
	
			ИмяКолонки = ПрефиксДопРеквизит + РеквизитИсточника.Имя;
			
			Колонка = ТекущийИсточникДанных.Значение.Колонки.Найти(ИмяКолонки);
			Если Колонка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НовоеИмяКолонки = РеквизитИсточника.Имя;
			Если ТекущийИсточникДанных.Значение.Колонки.Найти(НовоеИмяКолонки) <> Неопределено Тогда
				// такая колонка уже есть. При попытке изменения имени возникнет исключение
				Продолжить;
			КонецЕсли;
			Колонка.Имя = НовоеИмяКолонки;
		
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура СократитьСтроковыеПоляТаблицыПроводок(ТаблицаПроводок)

	ЕстьКолонкаНомерПервичногоДокумента = ТаблицаПроводок.Колонки.Найти("НомерПервичногоДокумента") <> Неопределено;
	ЕстьКолонкаВидПервичногоДокумента   = ТаблицаПроводок.Колонки.Найти("ВидПервичногоДокумента") <> Неопределено;
	ЕстьКолонкаСодержание               = ТаблицаПроводок.Колонки.Найти("Содержание") <> Неопределено;
	
	Если НЕ ЕстьКолонкаНомерПервичногоДокумента
		ИЛИ НЕ ЕстьКолонкаВидПервичногоДокумента
		ИЛИ НЕ ЕстьКолонкаСодержание Тогда
		
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаПроводок Цикл
	
		СтрокаТаблицы.НомерПервичногоДокумента = СокрЛП(СтрокаТаблицы.НомерПервичногоДокумента);
		СтрокаТаблицы.ВидПервичногоДокумента   = СокрЛП(СтрокаТаблицы.ВидПервичногоДокумента);
		СтрокаТаблицы.Содержание               = СокрЛП(СтрокаТаблицы.Содержание);
	
	КонецЦикла; 

КонецПроцедуры

Процедура ПроверитьЗаполнениеВидовСубконтоПодразделений(ТаблицаПроводок)

	Для каждого ТекСтрока Из ТаблицаПроводок Цикл
		
		ПроверитьЗаполнениеВидовСубконтоПодразделенийСтороныПроводки(ТекСтрока, "Дт");
		ПроверитьЗаполнениеВидовСубконтоПодразделенийСтороныПроводки(ТекСтрока, "Кт");
	
	КонецЦикла; 

КонецПроцедуры

Процедура ПроверитьЗаполнениеВидовСубконтоПодразделенийСтороныПроводки(ТекСтрока, Сторона)

	Счет = ТекСтрока["Счет" + Сторона];
	Если Не ЗначениеЗаполнено(Счет) Тогда
		ОчиститьПодразделениеВСторонеПроводки(ТекСтрока, Сторона, Ложь);
		Возврат;
	КонецЕсли;
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет);
	ОчиститьПодразделениеВСторонеПроводки(ТекСтрока, Сторона, СвойстваСчета.УчетПоПодразделениям);
			
	Для Счетчик = 1 по СвойстваСчета.КоличествоСубконто Цикл
		
		ВидСубконтоСчета = СвойстваСчета["ВидСубконто" + Счетчик];
		ТипЗначенияСубконто = СвойстваСчета["ВидСубконто" + Счетчик + "ТипЗначения"];
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока["ВидСубконто" + Сторона + Счетчик]) Тогда
			ТекСтрока["ВидСубконто" + Сторона + Счетчик] = ВидСубконтоСчета;
			ТекСтрока["Субконто" + Сторона + Счетчик] = ТипЗначенияСубконто.ПривестиЗначение(
				ТекСтрока["Субконто" + Сторона + Счетчик]);
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока["ВидСубконто" + Сторона + Счетчик] = ВидСубконтоСчета Тогда
			Продолжить;
		КонецЕсли; 
		
		Для Счетчик2 = Счетчик + 1 По СвойстваСчета.КоличествоСубконто Цикл
			Если ТекСтрока["ВидСубконто" + Сторона + Счетчик2] = ВидСубконтоСчета Тогда
				ЗаменитьЗначенияВСтроке(ТекСтрока, "ВидСубконто" + Сторона + Счетчик, "ВидСубконто" + Сторона + Счетчик2);
				ЗаменитьЗначенияВСтроке(ТекСтрока, "Субконто" + Сторона + Счетчик,    "Субконто" + Сторона + Счетчик2);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Процедура ОчиститьПодразделениеВСторонеПроводки(ТекСтрока, Сторона, УчетПоПодразделениям)
	
	Если Не УчетПоПодразделениям И ЗначениеЗаполнено(ТекСтрока["Подразделение" + Сторона]) Тогда
		ТекСтрока["Подразделение" + Сторона] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменитьЗначенияВСтроке(ТекСтрока, ИмяКолонки1, ИмяКолонки2)
	
	ВрЗначение = ТекСтрока[ИмяКолонки1];
	ТекСтрока[ИмяКолонки1] = ТекСтрока[ИмяКолонки2];
	ТекСтрока[ИмяКолонки2] = ВрЗначение;
	
КонецПроцедуры

Процедура ВывестиОшибкиКонтекстаПроведения(Отказ = Ложь)

	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();

	ВыведенныеОшибки = Новый ТаблицаЗначений;
	ВыведенныеОшибки.Колонки.Добавить("ТекстСообщения", Новый ОписаниеТипов("Строка"));
	ВыведенныеОшибки.Колонки.Добавить("ИмяПоля",		Новый ОписаниеТипов("Строка"));
	
	Если КонтекстПроведения.Отказ Тогда
		Отказ = Истина;
		
		ТаблицаОшибок = КонтекстПроведения.ТаблицаОшибок;
		Для каждого ТекОшибка Из ТаблицаОшибок Цикл
			
			Отбор = Новый Структура("ТекстСообщения, ИмяПоля");
			Отбор.ТекстСообщения = СокрЛП(ТекОшибка.ТекстСообщения);
			Отбор.ИмяПоля        = СокрЛП(ТекОшибка.ИмяПоля);
			ОшибкаВыведена = ВыведенныеОшибки.НайтиСтроки(Отбор).Количество() > 0; 
			
			Если НЕ ОшибкаВыведена Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекОшибка.ТекстСообщения,
																  ДокументОснование,
																  ТекОшибка.ИмяПоля);
				
				ЗаполнитьЗначенияСвойств(ВыведенныеОшибки.Добавить(), ТекОшибка);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьПроводкиПоСхеме(НаборСвойств,
								 ВнешниеНаборыДанных = Неопределено,
								 ТаблицаОшибок = Неопределено,
								 ПроверятьОшибки = Ложь,
								 ДокументОбъект = Неопределено,
								 СохраненныеПроводки = Неопределено,
								 Отказ = Ложь) Экспорт
	
	ПараметрыЗаполненияПроводок = ПараметрыЗаполненияПроводок();
	ПараметрыЗаполненияПроводок.НаборСвойств 		= НаборСвойств;
	ПараметрыЗаполненияПроводок.ВнешниеНаборыДанных = ВнешниеНаборыДанных;
	ПараметрыЗаполненияПроводок.ТаблицаОшибок 		= ТаблицаОшибок;
	ПараметрыЗаполненияПроводок.ПроверятьОшибки 	= ПроверятьОшибки;
	ПараметрыЗаполненияПроводок.ДокументОбъект 		= ?(ДокументОбъект = Неопределено, ДокументОснование.ПолучитьОбъект(), ДокументОбъект);
	ПараметрыЗаполненияПроводок.СохраненныеПроводки	= СохраненныеПроводки;
	
	РучнаяТранзакция = НЕ ТранзакцияАктивна();
	Если РучнаяТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Результат = ЗаполнитьПроводкиДокумента(ПараметрыЗаполненияПроводок, Отказ);
	Если РучнаяТранзакция Тогда
		Если Отказ = Ложь Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
